{
  "Ihram": {
    "steps": [
      {
        "title": "Physical Purity",
        "description": "Before getting changed into the Ihram garments, take care of your personal hygiene by clipping your nails and removing the hair under your armpits and beneath the navel. You should then do ghusl, a highly emphasised sunnah for those intending to enter into a state of Ihram. If you can’t perform ghusl, doing wudhu will suffice. Men may apply attar/perfume to their heads/beards, ensuring not to get any on the Ihram garments. This should all be carried out at your place of residence before your journey."
      },
      {
        "title": "Ihram Garments",
        "description": "You will then get changed into your Ihram garments which for men consist of two, normally white, clean seamless pieces of cloth. The sheet which wraps around the waist covering the lower body is known as the izar, and the sheet that is draped over the upper body like a shawl is known as the rida. Sandals shouldn’t cover the heel and ankle. The Hanafi school of thought stipulates that the top part of the foot should also remain exposed.\n\nEnsure you put on your Ihram attire before crossing the designated Miqat. Where you wear the garments depends on your point of departure and your destination.\n\nIf you’re travelling to Makkah via Jeddah on an aeroplane, it is advisable to get changed into your Ihram at home or at the airport before departure or during a stopover if you have one. At the airport, you can check in first and get changed in the prayer room or bathroom. Alternatively, you can put on your Ihram in-flight although bear in mind that aeroplane bathrooms are usually very limited in space, and there may well be a rush of people intending to do the same thing as the Miqat approaches. If you decide to change into your Ihram attire on the plane, do so at least an hour before the Miqat is crossed. Opting to get changed mid-flight is the least recommended option.\n\nIf you’re going to Madinah before Makkah, you don’t need to enter into the state of Ihram and may wear regular clothing during your stay there. Before leaving for Makkah, you should don the Ihram at your hotel in Madinah or the designated Miqat for Madinah, Masjid Dhul Hulayfah. The taxi/coach will stop at the mosque on the way so you can enter into Ihram there if you need to do so. If you’re taking the train to Makkah, you should put on your Ihram at the hotel or at the train station prior to departure.\n\nYou may delay making your intention until the Miqat approaches. Just before crossing, remove any articles of clothing that you may still be wearing that violate the conditions of Ihram, such as socks, headwear and underwear. On planes, trains and coaches, you will hear an announcement regarding the upcoming Miqat as you approach the designated point.\n\nWomen aren’t required to conform to a specific dress code. Clothing should be normal modest Islamic dress with a head covering of any colour. Hands and faces must remain exposed, although socks may be worn."
      },
      {
        "title": "Salah al-Ihram",
        "description": "It’s sunnah to perform two rak’ahs of salah before entering into the state of Ihram. This can be performed at home, after getting changed at the airport or in-flight before crossing the Miqat, providing there are prayer facilities on board. If you’re in Madinah, you can perform the prayer in your hotel, in Masjid Nabawi, at the designated Miqat point or on the train. Observe the prayer with the intention of performing two rak’ahs nafl for Ihram.\n\nSince you’re not yet in the spiritual state of Ihram, the prayer may be observed with the head covered. It is recommended to recite Surah al-Kafirun (Surah 109) in the first rak’ah and Surah al-Ikhlas (Surah 112) in the second, although other surahs may be read. Don’t forget to make du’a after this salah."
      },
      {
        "title": "Niyyah",
        "description": "The niyyah for Umrah should be made at the Miqat or close to it as you move in its direction. Ideally, you should delay making the intention until the last moment so you aren’t restricted by its prohibitions for longer than need be. It is recommended (mustahabb) that you make the intention verbally, as well as reiterating it internally.\n\nFollowing are three examples of intentions that may be uttered in Arabic:\n\nلَبَّيْكَ اَللَّهُمَّ عُمْرَةً ❁\nLabbayka Llāhumma ʿUmrah.\nO Allah, here I am to perform Umrah.\n\nاَللَّهُمَّ إِنِّي أُرِيدُ الْعُمْرَةَ ❁\nAllāhumma innī urīdu l-ʿUmrah.\nO Allah, I intend to perform Umrah.\n\nاَللَّهُمَّ إِنِّي أُرِيدُ الْعُمْرَةَ فَيَسِّرْهَا لِي وَتَقَبَّلْهَا مِنِّي ❁\nAllāhumma innī urīdu l-ʿUmrata fa yassirhā lī wa taqabbalhā minnī.\nO Allah, I intend to perform Umrah, so make it easy for me and accept it from me."
      },
      {
        "title": "Talbiyah",
        "description": "After making your niyyah, you must recite the Talbiyah to validate your intention and enter into the state of Ihram. The utterance of the Talbiyah is wajib according to the Hanafi and Maliki schools of thought. The Shafi’i and Hanbali schools consider it a sunnah.\n\nYou must recite the Talbiyah at least once after making your intention for Umrah. Failure to do so will result in an invalid Umrah!\n\nThe sunnah method of reciting the Talbiyah is to briefly pause at four places, indicated by the dashes. The prayer is as follows:\n\nلَبَّيْكَ اَللَّهُمَّ لَبَّيْكَ – لَبَّيْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ – إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ – لَا شَرِيكَ لَكَ – ❁\nLabbayka Llāhumma labbayk, labbayka lā sharīka laka labbayk, inna l-ḥamda wa n-niʿmata, laka wa l-mulk, lā sharīka lak.\nAt Your service, Allah, at Your service. At Your service, You have no partner, at Your service. Truly all praise, favour and sovereignty are Yours. You have no partner.\n\nAfter uttering the Talbiyah, you will now be in the state of Ihram and be known as a Muhrim. Make sure you’re well aware of the prohibitions of Ihram and ensure you don’t fall foul of its rules. If a rule of Ihram is violated, Damm or Sadaqah will be required as expiation.\n\nIt is recommended to send Salawat on the Prophet ﷺ after reciting the Talbiyah and to make du’a for yourself and others. Continue reciting the Talbiyah for the rest of your journey until you reach one of the doors of Masjid al-Haram prior to performing Tawaf."
      }
    ]
  }
}
