[
  {
    "title": "Physical Purity",
    "description": "Before getting changed into the Ihram garments, take care of your personal hygiene by clipping your nails and removing the hair under your armpits and beneath the navel. You should then do ghusl, a highly emphasised sunnah for those intending to enter into a state of Ihram. If you can’t perform ghusl, doing wudhu will suffice. Men may apply attar/perfume to their heads/beards, ensuring not to get any on the Ihram garments. This should all be carried out at your place of residence before your journey.",
    "image": "assets/images/umrah_guide/physical_purity.png"
  },
  {
    "title": "Ihram Garments",
    "description": "You will then get changed into your Ihram garments which for men consist of two, normally white, clean seamless pieces of cloth. The sheet which wraps around the waist covering the lower body is known as the izar, and the sheet that is draped over the upper body like a shawl is known as the rida. Sandals shouldn’t cover the heel and ankle. The Hanafi school of thought stipulates that the top part of the foot should also remain exposed.\n\nEnsure you put on your Ihram attire before crossing the designated Miqat. Where you wear the garments depends on your point of departure and your destination.\n\nIf you’re travelling to Makkah via Jeddah on an aeroplane, it is advisable to get changed into your Ihram at home or at the airport before departure or during a stopover if you have one. At the airport, you can check in first and get changed in the prayer room or bathroom. Alternatively, you can put on your Ihram in-flight although bear in mind that aeroplane bathrooms are usually very limited in space, and there may well be a rush of people intending to do the same thing as the Miqat approaches. If you decide to change into your Ihram attire on the plane, do so at least an hour before the Miqat is crossed. Opting to get changed mid-flight is the least recommended option.\n\nIf you’re going to Madinah before Makkah, you don’t need to enter into the state of Ihram and may wear regular clothing during your stay there. Before leaving for Makkah, you should don the Ihram at your hotel in Madinah or the designated Miqat for Madinah, Masjid Dhul Hulayfah. The taxi/coach will stop at the mosque on the way so you can enter into Ihram there if you need to do so. If you’re taking the train to Makkah, you should put on your Ihram at the hotel or at the train station prior to departure.\n\nYou may delay making your intention until the Miqat approaches. Just before crossing, remove any articles of clothing that you may still be wearing that violate the conditions of Ihram, such as socks, headwear and underwear. On planes, trains and coaches, you will hear an announcement regarding the upcoming Miqat as you approach the designated point.\n\nWomen aren’t required to conform to a specific dress code. Clothing should be normal modest Islamic dress with a head covering of any colour. Hands and faces must remain exposed, although socks may be worn.",
    "image": "assets/images/umrah_guide/ihram.png"
  },
  {
    "title": "Salah al-Ihram",
    "description": "It’s sunnah to perform two rak’ahs of salah before entering into the state of Ihram. This can be performed at home, after getting changed at the airport or in-flight before crossing the Miqat, providing there are prayer facilities on board. If you’re in Madinah, you can perform the prayer in your hotel, in Masjid Nabawi, at the designated Miqat point or on the train. Observe the prayer with the intention of performing two rak’ahs nafl for Ihram.\n\nSince you’re not yet in the spiritual state of Ihram, the prayer may be observed with the head covered. It is recommended to recite Surah al-Kafirun (Surah 109) in the first rak’ah and Surah al-Ikhlas (Surah 112) in the second, although other surahs may be read. Don’t forget to make du’a after this salah.",
    "image": "assets/images/umrah_guide/ihram_salah.png"
  },
  {
    "title": "Niyyah",
    "description": "The niyyah for Umrah should be made at the Miqat or close to it as you move in its direction. Ideally, you should delay making the intention until the last moment so you aren’t restricted by its prohibitions for longer than need be. It is recommended (mustahabb) that you make the intention verbally, as well as reiterating it internally.\n\nFollowing are three examples of intentions that may be uttered in Arabic:\n\nلَبَّيْكَ اَللَّهُمَّ عُمْرَةً ❁\nLabbayka Llāhumma ʿUmrah.\nO Allah, here I am to perform Umrah.\n\nاَللَّهُمَّ إِنِّي أُرِيدُ الْعُمْرَةَ ❁\nAllāhumma innī urīdu l-ʿUmrah.\nO Allah, I intend to perform Umrah.\n\nاَللَّهُمَّ إِنِّي أُرِيدُ الْعُمْرَةَ فَيَسِّرْهَا لِي وَتَقَبَّلْهَا مِنِّي ❁\nAllāhumma innī urīdu l-ʿUmrata fa yassirhā lī wa taqabbalhā minnī.\nO Allah, I intend to perform Umrah, so make it easy for me and accept it from me.",
    "image": "assets/images/umrah_guide/niyyah.png"
  },
  {
    "title": "Talbiyah",
    "description": "After making your niyyah, you must recite the Talbiyah to validate your intention and enter into the state of Ihram. The utterance of the Talbiyah is wajib according to the Hanafi and Maliki schools of thought. The Shafi’i and Hanbali schools consider it a sunnah.\n\nYou must recite the Talbiyah at least once after making your intention for Umrah. Failure to do so will result in an invalid Umrah!\n\nThe sunnah method of reciting the Talbiyah is to briefly pause at four places, indicated by the dashes. The prayer is as follows:\n\nلَبَّيْكَ اَللَّهُمَّ لَبَّيْكَ – لَبَّيْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ – إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ – لَا شَرِيكَ لَكَ – ❁\nLabbayka Llāhumma labbayk, labbayka lā sharīka laka labbayk, inna l-ḥamda wa n-niʿmata, laka wa l-mulk, lā sharīka lak.\nAt Your service, Allah, at Your service. At Your service, You have no partner, at Your service. Truly all praise, favour and sovereignty are Yours. You have no partner.\n\nAfter uttering the Talbiyah, you will now be in the state of Ihram and be known as a Muhrim. Make sure you’re well aware of the prohibitions of Ihram and ensure you don’t fall foul of its rules. If a rule of Ihram is violated, Damm or Sadaqah will be required as expiation.\n\nIt is recommended to send Salawat on the Prophet ﷺ after reciting the Talbiyah and to make du’a for yourself and others. Continue reciting the Talbiyah for the rest of your journey until you reach one of the doors of Masjid al-Haram prior to performing Tawaf.",
    "image": "assets/images/umrah_guide/talbiyah.png"
  },
  {
    "title": "Haram of Makkah",
    "description": "The Haram of Makkah is a sacred area that extends several miles around Masjid al-Haram in all directions. In this area, it is forbidden to:\n· Cut or damage grass, trees or any other type of vegetation.\n· Harm or kill wild animals. This includes scaring away pigeons and other birds.\n· Carry weapons.\n· Fight or behave in a way that will violate the sanctity of this area.\n\nAlthough you’re unlikely to breach one of these rules, keep in mind the sanctity of Makkah.",
    "image": "assets/images/umrah_guide/haram_makkah.png"
  },
  {
    "title": "Entering Makkah",
    "description": "As you reach the limits of the Haram, constantly recite the Talbiyah, do dhikr and send Salawat upon the Prophet ﷺ. Recital of the following du’a is recommended upon entering the Haram:\n\nاَللَّهُمَّ هَذَا حَرَمُكَ وَأَمْنُكَ فَحَرِّمْنِي عَلَى النَّارِ ❁ وَأَمِنِّي مِنْ عَذَابِكَ يَوْمَ تَبْعَثُ عِبَادَكَ ❁ وَاجْعَلْنِي مِنْ أَوْلِيَائِكَ وَأَهْلِ طَاعَتِكَ ❁\nAllāhumma hādhā ḥaramuka wa amnuka fa ḥarrimnī ʿala n-nār(i), wa aminnī min ʿadhābika yawma tabʿathu ʿibādak(a), wa jʿalnī min awliyā’ika wa ahli ṭāʿatik.\n\nO Allah, this is Your sanctuary and security, so make me unlawful to the hellfire, make me safe from Your punishment on the day You resurrect Your servants, and make me one of Your friends and one of the people who obey You.\n\nAfter arriving at your accommodation in Makkah, you may want to freshen up or take a rest before making your way to Masjid al-Haram to perform Tawaf al-Umrah. If you decide to take a shower, ensure you don’t use any items that are prohibited in the state of Ihram, e.g. scented soap or shampoo. It is recommended you present yourself at Masjid al-Haram as soon as possible.\n\nWhen you’re ready, decide which of your belongings you want to take with you, bearing in mind there are thieves that operate in the mosque.\n\nTip: It is recommended that you take a drawstring bag for your shoes. Keep them close to you because they can get lost.",
    "image": "assets/images/umrah_guide/first_sight.png"
  },
  {
    "title": "Entering Masjid al-Haram",
    "description": "It is sunnah to enter Masjid al-Haram via Bab al-Salam (the Gate of Peace). This may not be possible as the authorities have designated entrances to the mosque for pilgrims performing Umrah. Proceed through one of these entrances. Step through with your right foot first and recite the supplication for entering a mosque. Either or both of these supplications may be recited:\n\nبِسْمِ اللهِ ❁ اَللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ ❁ اللّٰهُمَّ اغْفِرْ لِي وَافْتَحْ لِي أَبْوَابَ رَحْمَتِكَ ❁\nBismi Llāh. Allāhumma ṣalli ʿalā Muḥammad. Allāhumma-ghfir lī wa-ftaḥ lī abwāba raḥmatik.\nIn the name of Allah, send prayers upon Muhammad ﷺ. O Allah, forgive me and open for me the doors of Your Mercy.\n\nأَعُوذُ بِاللهِ الْعَظِيمِ ❁ وَبِوَجْهِهِ الْكَرِيمِ ❁ وَسُلْطَانِهِ الْقَدِيمِ ❁ مِنَ الشَّيْطَانِ الرَّجِيمِ ❁\nAʿūdhu bi-Llāhi l-aẓīm(i), wa bi-wajhihi l-karīm(i), wa sulṭānihi l-qadīm(i), mina sh-shayṭāni r-rajīm.\nI seek protection in Allah the Tremendous, His Noble Countenance, and His pre-eternal Sovereign Might from Shaytan the rejected.",
    "image": "assets/images/umrah_guide/haram_makkah.png"
  },
  {
    "title": "First Sight of the Kaaba",
    "description": "After entering the mosque, keep your gaze lowered until you reach the mataf area, which is the open space where Tawaf takes place. When you’re ready, with humility, awe and reverence, lift your gaze to set sight on the beatific vision of the Holy Kaaba.\n\nUpon seeing the Kaaba for the first time, raise your hands and make du’a with the utmost concentration and sincerity, as this is among those places where prayers are answered. Remember to recite Salawat upon the Prophet ﷺ when making du’a. Umar ibn al-Khattab I narrated:\n\nDua is suspended between heaven and earth and none of it is taken up until you send blessings upon your Prophet ﷺ.\n[Narrated in Sunan al-Tirmidhi]\n\nImam Abu Hanifa I would use this opportunity to make du’a to Allah that he be among those whose supplications are always accepted.\n\nRecite the following three times:\n\nاللّٰهُ أَكْبَرُ ❁ اللّٰهُ أَكْبَرُ ❁ لَآ اِلَهَ اِلَّا اللّٰهُ ❁\n\nAllāhu akbar. Allāhu akbar. Lā ilāha illa Llāh.\nAllah is the Greatest. Allah is the Greatest. There is no God except Allah.\n\nIt’s a sunnah to recite the following du’as:\n\nاَللَّهُمَّ زِدْ هَذَا الْبَيْتَ تَشْرِيفاً وَتَعْظِيمًا وَتَكْرِيمًا وَمَهَابَةً ❁ وَزِدْ مَنْ شَرَّفَهُ وَكَرَّمَهُ مِمَّنْ حَجَّهُ أَوْ اعْتَمَرَهُ تَشْرِيفًا وَتَكْرِيمًا وَتَعْظِيمًا وَبِرًّا ❁\n\nAllāhumma zid hādha l-bayta tashrīfan wa taʿẓīman wa takrīman wa mahābah, wa zid man sharrafahu wa karramahu mimman ḥajjahu aw iʿtamarahu tashrīfan wa takrīman wa taʿẓīman wa birrā.\n\nAllah, increase this House in honour, esteem, respect and reverence. And increase those who honour and respect it—of those who perform Hajj or Umrah—in honour, respect, esteem and piety.\n\nاَللَّهُمَّ أَنْتَ السَّلاَمُ ❁ وَمِنْكَ السَّلَامُ ❁ حَيِّنَا رَبَّنَا بِالسَّلاَمِ ❁\n\nAllāhumma anta s-salām, wa minka s-salām, ḥayyinā rabbanā bi s-salām.\nO Allah, You are Peace and from You is peace. Make us live, Lord, in peace.\n\nDo dhikr, make du’a and send Salawat upon the Prophet ﷺ in abundance here. Make the most of this opportunity before you begin your Tawaf, especially if it’s the first time you’ve set eyes on the Kaaba.",
    "image": "assets/images/umrah_guide/first_sight.png"
  }
]
